Revit 2024 API
FamilySizeTable.NumberOfColumns Property
 Number of columns in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int NumberOfColumns { get; }
Visual Basic
Public ReadOnly Property NumberOfColumns As Integer
	Get
Visual C++
public:
property int NumberOfColumns {
	int get ();
}
See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace